TomCrypto/max32660/svd/MAX32660.xml
<?xml version='1.0' encoding='utf-8'?>
<device xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.1" xsi:noNamespaceSchemaLocation="svd_schema.xsd">
  <vendor>Maxim-Integrated</vendor>
  <vendorID>Maxim</vendorID>
  <name>max32660</name>
  <series>ARMCM4</series>
  <version>1.0</version>
  <description>MAX32660 Tiny, Ultra-Low-Power ARM Cortex-M4 Processor with FPU-Based Microcontroller with 256KB Flash and 96KB SRAM.</description>
  <cpu>
    <name>CM4</name>
    <revision>r2p1</revision>
    <endian>little</endian>
    <mpuPresent>true</mpuPresent>
    <fpuPresent>true</fpuPresent>
    <nvicPrioBits>3</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>0x20</size>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <peripherals>
    <peripheral>
      <name>DMA</name>
      <description>Direct Memory Access Controller.</description>
      <baseAddress>0x40028000</baseAddress>
      <size>32</size>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMA0</name>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>DMA1</name>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>DMA2</name>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>DMA3</name>
        <value>31</value>
      </interrupt>
      <registers>
        <register>
          <name>INT_EN</name>
          <description>DMA Control.</description>
          <addressOffset>0x000</addressOffset>
          <fields>
            <field>
              <name>CHIEN0</name>
              <description>Channel 0 Interrupt Enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHIEN1</name>
              <description>Channel 1 Interrupt Enable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHIEN2</name>
              <description>Channel 2 Interrupt Enable.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHIEN3</name>
              <description>Channel 3 Interrupt Enable.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_FL</name>
          <description>DMA Interrupt.</description>
          <addressOffset>0x004</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>IPEND0</name>
              <description>Channel 0 Interrupt Pending.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No interrupt is pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPEND1</name>
              <description>Channel 1 Interrupt Pending.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No interrupt is pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPEND2</name>
              <description>Channel 2 Interrupt Pending.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No interrupt is pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPEND3</name>
              <description>Channel 3 Interrupt Pending.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No interrupt is pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>CH[%s]</name>
          <description>DMA Channel registers.</description>
          <headerStructName>dma_ch</headerStructName>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <register>
            <name>CFG</name>
            <description>DMA Channel Configuration.</description>
            <addressOffset>0x000</addressOffset>
            <fields>
              <field>
                <name>CHEN</name>
                <description>Channel Enable.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>disabled</name>
                    <description>Disabled.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>enabled</name>
                    <description>Enabled.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RLDEN</name>
                <description>Reload Enable.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>disabled</name>
                    <description>Disabled.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>enabled</name>
                    <description>Enabled.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PRI</name>
                <description>DMA Priority.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>high</name>
                    <description>High priority.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>medium_high</name>
                    <description>Medium-high priority.</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>medium_low</name>
                    <description>Medium-low priority.</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>low</name>
                    <description>Low priority.</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REQSEL</name>
                <description>Request Select.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>6</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>mem_to_mem</name>
                    <description>Memory-to-memory.</description>
                    <value>0x00</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>spi0_rx</name>
                    <description>SPI0 RX.</description>
                    <value>0x01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>spi1_rx</name>
                    <description>SPI1 RX.</description>
                    <value>0x02</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>uart0_rx</name>
                    <description>UART0 RX.</description>
                    <value>0x04</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>uart1_rx</name>
                    <description>UART1 RX.</description>
                    <value>0x05</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>i2c0_rx</name>
                    <description>I2C0 RX.</description>
                    <value>0x07</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>i2c1_rx</name>
                    <description>I2C1 RX.</description>
                    <value>0x08</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>spi0_tx</name>
                    <description>SPI0 TX.</description>
                    <value>0x21</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>spi1_tx</name>
                    <description>SPI1 TX.</description>
                    <value>0x22</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>uart0_tx</name>
                    <description>UART0 TX.</description>
                    <value>0x24</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>uart1_tx</name>
                    <description>UART1 TX.</description>
                    <value>0x25</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>i2c0_tx</name>
                    <description>I2C0 TX.</description>
                    <value>0x27</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>i2c1_tx</name>
                    <description>I2C1 TX.</description>
                    <value>0x28</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REQWAIT</name>
                <description>Request Wait Enable.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>disabled</name>
                    <description>Disabled.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>enabled</name>
                    <description>Enabled.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TOSEL</name>
                <description>Time-Out Select.</description>
                <bitOffset>11</bitOffset>
                <bitWidth>3</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>to4</name>
                    <description>Timeout of 3 to 4 prescale clocks.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>to8</name>
                    <description>Timeout of 7 to 8 prescale clocks.</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>to16</name>
                    <description>Timeout of 15 to 16 prescale clocks.</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>to32</name>
                    <description>Timeout of 31 to 32 prescale clocks.</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>to64</name>
                    <description>Timeout of 63 to 64 prescale clocks.</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>to128</name>
                    <description>Timeout of 127 to 128 prescale clocks.</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>to256</name>
                    <description>Timeout of 255 to 256 prescale clocks.</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>to512</name>
                    <description>Timeout of 511 to 512 prescale clocks.</description>
                    <value>7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PSSEL</name>
                <description>Pre-Scale Select.</description>
                <bitOffset>14</bitOffset>
                <bitWidth>2</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>disabled</name>
                    <description>Disable timer.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>div_256</name>
                    <description>Divide by 256.</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>div_64k</name>
                    <description>Divide by 64K.</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>div_16m</name>
                    <description>Divide by 16M.</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SRCWD</name>
                <description>Source Width.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>byte</name>
                    <description>Byte.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>half_word</name>
                    <description>Half-word.</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>word</name>
                    <description>Word.</description>
                    <value>2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SRCINC</name>
                <description>Source Increment Enable.</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>disabled</name>
                    <description>Disabled.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>enabled</name>
                    <description>Enabled.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DSTWD</name>
                <description>Destination Width.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>2</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>byte</name>
                    <description>Byte.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>half_word</name>
                    <description>Half-word.</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>word</name>
                    <description>Word.</description>
                    <value>2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DSTINC</name>
                <description>Destination Increment Enable.</description>
                <bitOffset>22</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>disabled</name>
                    <description>Disabled.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>enabled</name>
                    <description>Enabled.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BRST</name>
                <description>Burst Size.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>5</bitWidth>
              </field>
              <field>
                <name>CHDIEN</name>
                <description>Channel Disable Interrupt Enable.</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>disabled</name>
                    <description>Disabled.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>enabled</name>
                    <description>Enabled.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CTZIEN</name>
                <description>Count-to-zero Interrupts Enable.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>disabled</name>
                    <description>Disabled.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>enabled</name>
                    <description>Enabled.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
