TomCrypto/max32660/svd/MAX32660.xml
          <register>
            <name>STAT</name>
            <description>DMA Channel Status.</description>
            <addressOffset>0x004</addressOffset>
            <fields>
              <field>
                <name>CH_ST</name>
                <description>Channel Status.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>disabled</name>
                    <description>Disabled.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>enabled</name>
                    <description>Enabled.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IPEND</name>
                <description>Channel Interrupt.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>inactive</name>
                    <description>No interrupt is pending.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>pending</name>
                    <description>An interrupt is pending.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CTZ_ST</name>
                <description>Count-to-Zero (CTZ) Status.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
                <enumeratedValues>
                  <usage>read</usage>
                  <enumeratedValue>
                    <name>no_event</name>
                    <description>The event has not occurred.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>occurred</name>
                    <description>The event has occurred.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
                <enumeratedValues>
                  <usage>write</usage>
                  <enumeratedValue>
                    <name>clear</name>
                    <description>Clear the interrupt flag.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RLD_ST</name>
                <description>Reload Status.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
                <enumeratedValues>
                  <usage>read</usage>
                  <enumeratedValue>
                    <name>no_event</name>
                    <description>The event has not occurred.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>occurred</name>
                    <description>The event has occurred.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
                <enumeratedValues>
                  <usage>write</usage>
                  <enumeratedValue>
                    <name>clear</name>
                    <description>Clear the interrupt flag.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BUS_ERR</name>
                <description>Bus Error.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
                <enumeratedValues>
                  <usage>read</usage>
                  <enumeratedValue>
                    <name>no_event</name>
                    <description>The event has not occurred.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>occurred</name>
                    <description>The event has occurred.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
                <enumeratedValues>
                  <usage>write</usage>
                  <enumeratedValue>
                    <name>clear</name>
                    <description>Clear the interrupt flag.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TO_ST</name>
                <description>Time-Out Status.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
                <enumeratedValues>
                  <usage>read</usage>
                  <enumeratedValue>
                    <name>no_event</name>
                    <description>The event has not occurred.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>occurred</name>
                    <description>The event has occurred.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
                <enumeratedValues>
                  <usage>write</usage>
                  <enumeratedValue>
                    <name>clear</name>
                    <description>Clear the interrupt flag.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SRC</name>
            <description>Source Device Address.</description>
            <addressOffset>0x008</addressOffset>
            <fields>
              <field>
                <name>SRC</name>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>DST</name>
            <description>Destination Device Address.</description>
            <addressOffset>0x00C</addressOffset>
            <fields>
              <field>
                <name>DST</name>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>CNT</name>
            <description>DMA Counter.</description>
            <addressOffset>0x010</addressOffset>
            <fields>
              <field>
                <name>CNT</name>
                <description>DMA Counter.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>24</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>SRC_RLD</name>
            <description>Source Address Reload Value.</description>
            <addressOffset>0x014</addressOffset>
            <fields>
              <field>
                <name>SRC_RLD</name>
                <description>Source Address Reload Value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>31</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>DST_RLD</name>
            <description>Destination Address Reload Value.</description>
            <addressOffset>0x018</addressOffset>
            <fields>
              <field>
                <name>DST_RLD</name>
                <description>Destination Address Reload Value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>31</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>CNT_RLD</name>
            <description>DMA Channel Count Reload.</description>
            <addressOffset>0x01C</addressOffset>
            <fields>
              <field>
                <name>CNT_RLD</name>
                <description>Count Reload Value.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>24</bitWidth>
              </field>
              <field>
                <name>RLDEN</name>
                <description>Reload Enable.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>disabled</name>
                    <description>Disabled.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>enabled</name>
                    <description>Enabled.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
