TomCrypto/max32660/svd/MAX32660.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>FCR</name>
      <description>Function Control.</description>
      <baseAddress>0x40000800</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>REG0</name>
          <description>Register 0.</description>
          <addressOffset>0x00</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>I2C0_SDA_FILTER_EN</name>
              <description>I2C0 SDA Filter Enable.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Filter disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Filter enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C0_SCL_FILTER_EN</name>
              <description>I2C0 SCL Filter Enable.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Filter disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Filter enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C1_SDA_FILTER_EN</name>
              <description>I2C1 SDA Filter Enable.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Filter disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Filter enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C1_SCL_FILTER_EN</name>
              <description>I2C1 SCL Filter Enable.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Filter disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Filter enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>FLC</name>
      <description>Flash Memory Control.</description>
      <prependToName>FLC_</prependToName>
      <baseAddress>0x40029000</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLC</name>
        <value>23</value>
      </interrupt>
      <registers>
        <register>
          <name>ADDR</name>
          <description>Flash Write Address.</description>
          <addressOffset>0x00</addressOffset>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Address for next operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKDIV</name>
          <description>Flash Clock Divide.</description>
          <addressOffset>0x04</addressOffset>
          <resetValue>0x00000064</resetValue>
          <fields>
            <field>
              <name>CLKDIV</name>
              <description>Flash Clock Divide.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>Flash Control.</description>
          <addressOffset>0x08</addressOffset>
          <fields>
            <field>
              <name>WRITE</name>
              <description>Write.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>complete</name>
                  <description>No operation/complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>start</name>
                  <description>Start operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="WRITE">
              <name>MASS_ERASE</name>
              <description>Mass Erase.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="WRITE">
              <name>PAGE_ERASE</name>
              <description>Page Erase.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WIDTH</name>
              <description>Data Width.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>size128</name>
                  <description>128-bit.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>size32</name>
                  <description>32-bit.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERASE_CODE</name>
              <description>Erase Code.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nop</name>
                  <description>No operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>erase_page</name>
                  <description>Enable page erase.</description>
                  <value>0x55</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>erase_all</name>
                  <description>Enable mass erase.</description>
                  <value>0xAA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUSY</name>
              <description>Flash Pending.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>idle</name>
                  <description>Idle.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Busy.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVE</name>
              <description>Low Voltage enable.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UNLOCK_CODE</name>
              <description>Flash Unlock.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>unlocked</name>
                  <description>Flash Unlocked.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>locked</name>
                  <description>Flash Locked.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR</name>
          <description>Flash Interrupt.</description>
          <addressOffset>0x024</addressOffset>
          <fields>
            <field>
              <name>DONE</name>
              <description>Flash Done Interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No interrupt is pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACCESS_FAIL</name>
              <description>Flash Access Fail.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_error</name>
                  <description>No error.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>error</name>
                  <description>Failure occurred.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DONE_IE</name>
              <description>Flash Done Interrupt Enable.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="DONE_IE">
              <name>ACCESS_FAIL_IE</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <name>DATA[%s]</name>
          <description>Flash Write Data.</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data next operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ACTRL</name>
          <description>Access Control Register. Writing the ACTRL register with the following values
            in the order shown, allows read and write access to the system and user Information
            block:
            pflc-actrl = 0x3a7f5ca3;
            pflc-actrl = 0xa1e34f20;
            pflc-actrl = 0x9608b2c1. When unlocked, a write of any word will disable access to
            system and user information block. Readback of this register is always zero.</description>
          <addressOffset>0x40</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>ACTRL</name>
              <description>Access control.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
