TomCrypto/max32660/svd/MAX32660.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>GCR</name>
      <description>Global Control Registers.</description>
      <baseAddress>0x40000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SCON</name>
          <description>System Control.</description>
          <addressOffset>0x00</addressOffset>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>FLASH_PAGE_FLIP</name>
              <description>Flips the Flash bottom and top halves.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Physical layout matches logical layout.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>swapped</name>
                  <description>Bottom half mapped to logical top half and vice versa.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FPU_DIS</name>
              <description>Floating Point Unit Disable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>enable Floating point unit.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>disable floating point unit.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICC_FLUSH</name>
              <description>Instruction Cache Controller Flush.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal Code Cache Operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>flush</name>
                  <description>Code Caches and CPU instruction buffer are flushed.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWD_DIS</name>
              <description>Serial Wire Debug Disable.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enable JTAG SWD.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disable JTAG SWD.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RST0</name>
          <description>Reset.</description>
          <addressOffset>0x04</addressOffset>
          <fields>
            <field>
              <name>DMA</name>
              <description>DMA Reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDT0</name>
              <description>Watchdog Timer Reset.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIO0</name>
              <description>GPIO0 Reset.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR0</name>
              <description>TMR0 Reset.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR1</name>
              <description>TMR1 Reset.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR2</name>
              <description>TMR2 Reset.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UART0</name>
              <description>UART0 Reset.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UART1</name>
              <description>UART1 Reset.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI0</name>
              <description>SPI0 Reset.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI1</name>
              <description>SPI1 Reset.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C0</name>
              <description>I2C0 Reset.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTC</name>
              <description>Real Time Clock Reset.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOFT</name>
              <description>Soft Reset.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PERIPH</name>
              <description>Peripheral Reset.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSTEM</name>
              <description>System Reset.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_CTRL</name>
          <description>Clock Control.</description>
          <addressOffset>0x08</addressOffset>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>PSC</name>
              <description>Prescaler Select.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>div1</name>
                  <description>Divide by 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div2</name>
                  <description>Divide by 2.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div4</name>
                  <description>Divide by 4.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div8</name>
                  <description>Divide by 8.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div16</name>
                  <description>Divide by 16.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div32</name>
                  <description>Divide by 32.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div64</name>
                  <description>Divide by 64.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div128</name>
                  <description>Divide by 128.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKSEL</name>
              <description>Clock Source Select.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>hirc</name>
                  <description>The internal 96 MHz oscillator is used for the system clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nano_ring</name>
                  <description>The nano-ring output is used for the system clock.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>x32k</name>
                  <description>X32K is used for the system clock.</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKRDY</name>
              <description>Clock Ready.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Switchover to the new clock source (as selected by CLKSEL) has not yet occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ready</name>
                  <description>System clock running from CLKSEL clock source.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>X32K_EN</name>
              <description>32kHz Crystal Oscillator Enable.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Is Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Is Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="X32K_EN">
              <name>HIRC_EN</name>
              <description>60MHz High Frequency Internal Reference Clock Enable.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>X32K_RDY</name>
              <description>32kHz Crystal Oscillator Ready.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not</name>
                  <description>Is not Ready.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ready</name>
                  <description>Is Ready.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="X32K_RDY">
              <name>HIRC_RDY</name>
              <description>60MHz HIRC Ready.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="X32K_RDY">
              <name>LIRC8K_RDY</name>
              <description>8kHz Low Frequency Reference Clock Ready.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PM</name>
          <description>Power Management.</description>
          <addressOffset>0x0C</addressOffset>
          <fields>
            <field>
              <name>MODE</name>
              <description>Operating Mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active</name>
                  <description>Active Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>shutdown</name>
                  <description>Shutdown Mode.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>backup</name>
                  <description>Backup Mode.</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIOWK_EN</name>
              <description>GPIO Wake Up Enable.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Wake Up Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Wake Up Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCWK_EN</name>
              <description>RTC Alarm Wake Up Enable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Wake Up Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Wake Up Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFIOPD</name>
              <description>HFIO DEEPSLEEP Auto Off.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active</name>
                  <description>Mode is Active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>deepsleep</name>
                  <description>Powered down in DEEPSLEEP.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
