TomCrypto/max32660/svd/MAX32660.xml
        <register>
          <name>PCLK_DIS0</name>
          <description>Peripheral Clock Disable.</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>GPIO0</name>
              <description>GPIO0 Clock Disable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clock_enabled</name>
                  <description>Peripheral clock enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clock_disabled</name>
                  <description>Peripheral clock disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA</name>
              <description>DMA Clock Disable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clock_enabled</name>
                  <description>Peripheral clock enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clock_disabled</name>
                  <description>Peripheral clock disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPI0</name>
              <description>SPI0 Clock Disable.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clock_enabled</name>
                  <description>Peripheral clock enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clock_disabled</name>
                  <description>Peripheral clock disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPI1</name>
              <description>SPI1 Clock Disable.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clock_enabled</name>
                  <description>Peripheral clock enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clock_disabled</name>
                  <description>Peripheral clock disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UART0</name>
              <description>UART0 Clock Disable.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clock_enabled</name>
                  <description>Peripheral clock enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clock_disabled</name>
                  <description>Peripheral clock disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UART1</name>
              <description>UART1 Clock Disable.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clock_enabled</name>
                  <description>Peripheral clock enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clock_disabled</name>
                  <description>Peripheral clock disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C0</name>
              <description>I2C0 Clock Disable.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clock_enabled</name>
                  <description>Peripheral clock enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clock_disabled</name>
                  <description>Peripheral clock disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMR0</name>
              <description>TMR0 Clock Disable.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clock_enabled</name>
                  <description>Peripheral clock enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clock_disabled</name>
                  <description>Peripheral clock disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMR1</name>
              <description>TMR1 Clock Disable.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clock_enabled</name>
                  <description>Peripheral clock enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clock_disabled</name>
                  <description>Peripheral clock disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMR2</name>
              <description>TMR2 Clock Disable.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clock_enabled</name>
                  <description>Peripheral clock enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clock_disabled</name>
                  <description>Peripheral clock disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C1D</name>
              <description>I2C1 Clock Disable.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Peripheral clock enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Peripheral clock disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_CTRL</name>
          <description>Memory Clock Control.</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>FWS</name>
              <description>Flash Wait State.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>RAM0_LS</name>
              <description>System RAM 0 Light Sleep Mode.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active</name>
                  <description>Memory is active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>light_sleep</name>
                  <description>Memory is in Light Sleep mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM1_LS</name>
              <description>System RAM 1 Light Sleep Mode.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active</name>
                  <description>Memory is active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>light_sleep</name>
                  <description>Memory is in Light Sleep mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM2_LS</name>
              <description>System RAM 2 Light Sleep Mode.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active</name>
                  <description>Memory is active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>light_sleep</name>
                  <description>Memory is in Light Sleep mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAM3_LS</name>
              <description>System RAM 3 Light Sleep Mode.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active</name>
                  <description>Memory is active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>light_sleep</name>
                  <description>Memory is in Light Sleep mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICACHE_RET</name>
              <description>ICache RAM Light Sleep Mode.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active</name>
                  <description>Memory is active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>light_sleep</name>
                  <description>Memory is in Light Sleep mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_ZCTRL</name>
          <description>Memory Zeroize Control.</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>SRAM_ZERO</name>
              <description>System RAM Block 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nop</name>
                  <description>No operation/complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>start</name>
                  <description>Start operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICACHE_ZERO</name>
              <description>Instruction Cache.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nop</name>
                  <description>No operation/complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>start</name>
                  <description>Start operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYS_STAT</name>
          <description>System Status.</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>ICECLOCK</name>
              <description>ARM ICE Lock Status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>unlocked</name>
                  <description>ICE is unlocked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>locked</name>
                  <description>ICE is locked.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RST1</name>
          <description>Reset 1.</description>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>I2C1</name>
              <description>I2C1 Reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>reset</name>
                  <description>Starts reset operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>reset_done</name>
                  <description>Reset complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Reset in progress.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCLK_DIS1</name>
          <description>Peripheral Clock Disable.</description>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>FLC</name>
              <description>Flash Controller Clock Disable.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clock_enabled</name>
                  <description>Peripheral clock enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clock_disabled</name>
                  <description>Peripheral clock disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICCD</name>
              <description>Instruction Cache Controller Clock Disable.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clock_enabled</name>
                  <description>Peripheral clock enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clock_disabled</name>
                  <description>Peripheral clock disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVTEN</name>
          <description>Event Enable.</description>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>DMAEVENT</name>
              <description>Enable DMA event.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX_EVT</name>
              <description>Enable RXEV pin event.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>REV</name>
          <description>Revision.</description>
          <addressOffset>0x50</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>REVISION</name>
              <description>Manufacturer Chip Revision.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SYS_IE</name>
          <description>System Status Interrupt Enable.</description>
          <addressOffset>0x54</addressOffset>
          <fields>
            <field>
              <name>ICEULIE</name>
              <description>Arm ICE Unlocked Interrupt Enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
