TomCrypto/max32660/svd/MAX32660.xml
        <register>
          <name>OUT</name>
          <description>Output Level.</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>p0</name>
              <description>Output level for pin 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low</name>
                  <description>Low for pin 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>high</name>
                  <description>High for pin 0.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p1</name>
              <description>Output level for pin 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low</name>
                  <description>Low for pin 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>high</name>
                  <description>High for pin 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p2</name>
              <description>Output level for pin 2.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low</name>
                  <description>Low for pin 2.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>high</name>
                  <description>High for pin 2.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p3</name>
              <description>Output level for pin 3.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low</name>
                  <description>Low for pin 3.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>high</name>
                  <description>High for pin 3.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p4</name>
              <description>Output level for pin 4.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low</name>
                  <description>Low for pin 4.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>high</name>
                  <description>High for pin 4.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p5</name>
              <description>Output level for pin 5.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low</name>
                  <description>Low for pin 5.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>high</name>
                  <description>High for pin 5.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p6</name>
              <description>Output level for pin 6.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low</name>
                  <description>Low for pin 6.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>high</name>
                  <description>High for pin 6.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p7</name>
              <description>Output level for pin 7.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low</name>
                  <description>Low for pin 7.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>high</name>
                  <description>High for pin 7.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p8</name>
              <description>Output level for pin 8.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low</name>
                  <description>Low for pin 8.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>high</name>
                  <description>High for pin 8.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p9</name>
              <description>Output level for pin 9.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low</name>
                  <description>Low for pin 9.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>high</name>
                  <description>High for pin 9.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p10</name>
              <description>Output level for pin 10.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low</name>
                  <description>Low for pin 10.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>high</name>
                  <description>High for pin 10.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p11</name>
              <description>Output level for pin 11.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low</name>
                  <description>Low for pin 11.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>high</name>
                  <description>High for pin 11.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p12</name>
              <description>Output level for pin 12.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low</name>
                  <description>Low for pin 12.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>high</name>
                  <description>High for pin 12.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p13</name>
              <description>Output level for pin 13.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low</name>
                  <description>Low for pin 13.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>high</name>
                  <description>High for pin 13.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_SET</name>
          <description>Output Level Set.</description>
          <addressOffset>0x1C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>p0</name>
              <description>Output level set for pin 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>high</name>
                  <description>High for pin 0.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p1</name>
              <description>Output level set for pin 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>high</name>
                  <description>High for pin 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p2</name>
              <description>Output level set for pin 2.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>high</name>
                  <description>High for pin 2.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p3</name>
              <description>Output level set for pin 3.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>high</name>
                  <description>High for pin 3.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p4</name>
              <description>Output level set for pin 4.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>high</name>
                  <description>High for pin 4.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p5</name>
              <description>Output level set for pin 5.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>high</name>
                  <description>High for pin 5.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p6</name>
              <description>Output level set for pin 6.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>high</name>
                  <description>High for pin 6.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p7</name>
              <description>Output level set for pin 7.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>high</name>
                  <description>High for pin 7.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p8</name>
              <description>Output level set for pin 8.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>high</name>
                  <description>High for pin 8.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p9</name>
              <description>Output level set for pin 9.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>high</name>
                  <description>High for pin 9.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p10</name>
              <description>Output level set for pin 10.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>high</name>
                  <description>High for pin 10.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p11</name>
              <description>Output level set for pin 11.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>high</name>
                  <description>High for pin 11.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p12</name>
              <description>Output level set for pin 12.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>high</name>
                  <description>High for pin 12.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p13</name>
              <description>Output level set for pin 13.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>high</name>
                  <description>High for pin 13.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_CLR</name>
          <description>Output Level Clear.</description>
          <addressOffset>0x20</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>p0</name>
              <description>Output level clear for pin 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low</name>
                  <description>Low for pin 0.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p1</name>
              <description>Output level clear for pin 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low</name>
                  <description>Low for pin 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p2</name>
              <description>Output level clear for pin 2.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low</name>
                  <description>Low for pin 2.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p3</name>
              <description>Output level clear for pin 3.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low</name>
                  <description>Low for pin 3.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p4</name>
              <description>Output level clear for pin 4.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low</name>
                  <description>Low for pin 4.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p5</name>
              <description>Output level clear for pin 5.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low</name>
                  <description>Low for pin 5.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p6</name>
              <description>Output level clear for pin 6.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low</name>
                  <description>Low for pin 6.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p7</name>
              <description>Output level clear for pin 7.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low</name>
                  <description>Low for pin 7.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p8</name>
              <description>Output level clear for pin 8.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low</name>
                  <description>Low for pin 8.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p9</name>
              <description>Output level clear for pin 9.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low</name>
                  <description>Low for pin 9.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p10</name>
              <description>Output level clear for pin 10.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low</name>
                  <description>Low for pin 10.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p11</name>
              <description>Output level clear for pin 11.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low</name>
                  <description>Low for pin 11.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p12</name>
              <description>Output level clear for pin 12.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low</name>
                  <description>Low for pin 12.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p13</name>
              <description>Output level clear for pin 13.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low</name>
                  <description>Low for pin 13.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
