TomCrypto/max32660/svd/MAX32660.xml
        <register>
          <name>EN2_CLR</name>
          <description>Alternate Function Bit 2 Select Clear.</description>
          <addressOffset>0x7C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>p0</name>
              <description>Alternate function bit 2 select clear for pin 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Alternate function bit 2 select disabled for pin 0.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p1</name>
              <description>Alternate function bit 2 select clear for pin 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Alternate function bit 2 select disabled for pin 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p2</name>
              <description>Alternate function bit 2 select clear for pin 2.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Alternate function bit 2 select disabled for pin 2.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p3</name>
              <description>Alternate function bit 2 select clear for pin 3.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Alternate function bit 2 select disabled for pin 3.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p4</name>
              <description>Alternate function bit 2 select clear for pin 4.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Alternate function bit 2 select disabled for pin 4.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p5</name>
              <description>Alternate function bit 2 select clear for pin 5.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Alternate function bit 2 select disabled for pin 5.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p6</name>
              <description>Alternate function bit 2 select clear for pin 6.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Alternate function bit 2 select disabled for pin 6.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p7</name>
              <description>Alternate function bit 2 select clear for pin 7.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Alternate function bit 2 select disabled for pin 7.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p8</name>
              <description>Alternate function bit 2 select clear for pin 8.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Alternate function bit 2 select disabled for pin 8.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p9</name>
              <description>Alternate function bit 2 select clear for pin 9.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Alternate function bit 2 select disabled for pin 9.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p10</name>
              <description>Alternate function bit 2 select clear for pin 10.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Alternate function bit 2 select disabled for pin 10.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p11</name>
              <description>Alternate function bit 2 select clear for pin 11.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Alternate function bit 2 select disabled for pin 11.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p12</name>
              <description>Alternate function bit 2 select clear for pin 12.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Alternate function bit 2 select disabled for pin 12.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p13</name>
              <description>Alternate function bit 2 select clear for pin 13.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Alternate function bit 2 select disabled for pin 13.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IS</name>
          <description>Input Hysteresis Enable.</description>
          <addressOffset>0xA8</addressOffset>
          <fields>
            <field>
              <name>p0</name>
              <description>Input hysteresis enable for pin 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Input hysteresis disabled for pin 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Input hysteresis enabled for pin 0.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p1</name>
              <description>Input hysteresis enable for pin 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Input hysteresis disabled for pin 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Input hysteresis enabled for pin 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p2</name>
              <description>Input hysteresis enable for pin 2.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Input hysteresis disabled for pin 2.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Input hysteresis enabled for pin 2.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p3</name>
              <description>Input hysteresis enable for pin 3.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Input hysteresis disabled for pin 3.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Input hysteresis enabled for pin 3.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p4</name>
              <description>Input hysteresis enable for pin 4.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Input hysteresis disabled for pin 4.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Input hysteresis enabled for pin 4.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p5</name>
              <description>Input hysteresis enable for pin 5.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Input hysteresis disabled for pin 5.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Input hysteresis enabled for pin 5.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p6</name>
              <description>Input hysteresis enable for pin 6.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Input hysteresis disabled for pin 6.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Input hysteresis enabled for pin 6.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p7</name>
              <description>Input hysteresis enable for pin 7.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Input hysteresis disabled for pin 7.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Input hysteresis enabled for pin 7.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p8</name>
              <description>Input hysteresis enable for pin 8.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Input hysteresis disabled for pin 8.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Input hysteresis enabled for pin 8.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p9</name>
              <description>Input hysteresis enable for pin 9.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Input hysteresis disabled for pin 9.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Input hysteresis enabled for pin 9.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p10</name>
              <description>Input hysteresis enable for pin 10.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Input hysteresis disabled for pin 10.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Input hysteresis enabled for pin 10.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p11</name>
              <description>Input hysteresis enable for pin 11.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Input hysteresis disabled for pin 11.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Input hysteresis enabled for pin 11.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p12</name>
              <description>Input hysteresis enable for pin 12.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Input hysteresis disabled for pin 12.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Input hysteresis enabled for pin 12.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>p13</name>
              <description>Input hysteresis enable for pin 13.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Input hysteresis disabled for pin 13.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Input hysteresis enabled for pin 13.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
