TomCrypto/max32660/svd/MAX32660.xml
        <register>
          <name>INTFL0</name>
          <description>Interrupt Status.</description>
          <addressOffset>0x08</addressOffset>
          <fields>
            <field>
              <name>DONEI</name>
              <description>Transfer Done Interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No Interrupt is Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRXMI</name>
              <description>Interactive Receive Interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No Interrupt is Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GCI</name>
              <description>Slave General Call Address Match Interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No Interrupt is Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AMI</name>
              <description>Slave Address Match Interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No Interrupt is Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXTHI</name>
              <description>Receive Threshold Interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No interrupt is pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXTHI</name>
              <description>Transmit Threshold Interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No interrupt is pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPI</name>
              <description>STOP Interrupt.</description>
              <bitRange>[6:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No interrupt is pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADRACKI</name>
              <description>Address Acknowledge Interrupt.</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No Interrupt is Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ARBERI</name>
              <description>Arbritation error Interrupt.</description>
              <bitRange>[8:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No Interrupt is Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOERI</name>
              <description>timeout Error Interrupt.</description>
              <bitRange>[9:9]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No Interrupt is Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADRERI</name>
              <description>Address NACK Error Interrupt.</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No Interrupt is Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATERI</name>
              <description>Data NACK Error Interrupt.</description>
              <bitRange>[11:11]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No Interrupt is Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DNRERI</name>
              <description>Do Not Respond Error Interrupt.</description>
              <bitRange>[12:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No Interrupt is Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STRTERI</name>
              <description>Start Error Interrupt.</description>
              <bitRange>[13:13]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No Interrupt is Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPERI</name>
              <description>Stop Error Interrupt.</description>
              <bitRange>[14:14]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No Interrupt is Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXLOI</name>
              <description>Transmit Lock Out Interrupt.</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>MAMI</name>
              <description>Multiple Slave Address Match Interrupt.</description>
              <bitRange>[19:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN0</name>
          <description>Interrupt Enable.</description>
          <addressOffset>0x0C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DONEIE</name>
              <description>Transfer Done Interrupt Enable.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Interrupt enabled when DONE = 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRXMIE</name>
              <description>Description not available.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Interrupt enabled when RX_MODE = 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GCIE</name>
              <description>Slave mode general call address match received input enable.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Interrupt enabled when GEN_CTRL_ADDR = 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AMIE</name>
              <description>Slave mode incoming address match interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Interrupt enabled when ADDR_MATCH = 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXTHIE</name>
              <description>RX FIFO Above Treshold Level Interrupt Enable.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXTHIE</name>
              <description>TX FIFO Below Treshold Level Interrupt Enable.</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPIE</name>
              <description>Stop Interrupt Enable.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Interrupt enabled when STOP = 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADRACKIE</name>
              <description>Received Address ACK from Slave Interrupt.</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ARBERIE</name>
              <description>Master Mode Arbitration Lost Interrupt.</description>
              <bitRange>[8:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOERIE</name>
              <description>Timeout Error Interrupt Enable.</description>
              <bitRange>[9:9]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADRERIE</name>
              <description>Master Mode Address NACK Received Interrupt.</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATERIE</name>
              <description>Master Mode Data NACK Received Interrupt.</description>
              <bitRange>[11:11]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DNRERIE</name>
              <description>Slave Mode Do Not Respond Interrupt.</description>
              <bitRange>[12:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STRTERIE</name>
              <description>Out of Sequence START condition detected interrupt.</description>
              <bitRange>[13:13]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPERIE</name>
              <description>Out of Sequence STOP condition detected interrupt.</description>
              <bitRange>[14:14]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Interrupt enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXLOIE</name>
              <description>TX FIFO Locked Out Interrupt.</description>
              <bitRange>[15:15]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Interrupt disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Interrupt enabled when TXLOIE = 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAMIE</name>
              <description>Multiple Slave Address Match Interrupt Enable.</description>
              <bitRange>[19:16]</bitRange>
            </field>
          </fields>
        </register>
