TomCrypto/max32660/svd/MAX32660.xml
        <register>
          <name>INTFL1</name>
          <description>Interrupt Status Register 1.</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>RXOFI</name>
              <description>Receiver Overflow Interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No Interrupt is Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXUFI</name>
              <description>Transmit Underflow Interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No Interrupt is Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN1</name>
          <description>Interrupt Status Register 1.</description>
          <addressOffset>0x14</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>RXOFIE</name>
              <description>Receiver Overflow Interrupt Enable.</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>No Interrupt is Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXUFIE</name>
              <description>Transmit Underflow Interrupt Enable.</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>No Interrupt is Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFOLEN</name>
          <description>FIFO Configuration.</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>RXLEN</name>
              <description>Receive FIFO Length.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXLEN</name>
              <description>Transmit FIFO Length.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCTRL0</name>
          <description>Receive Control Register 0.</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>DNR</name>
              <description>Do Not Respond.</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>respond</name>
                  <description>Always respond to address match.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>not_respond_rx_fifo_empty</name>
                  <description>Do not respond to address match when RX_FIFO is not empty.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXFSH</name>
              <description>Receive FIFO Flush.</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not_flushed</name>
                  <description>FIFO not flushed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>flush</name>
                  <description>Flush RX_FIFO.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXTH</name>
              <description>Receive FIFO Threshold.</description>
              <bitRange>[11:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCTRL1</name>
          <description>Receive Control Register 1.</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>RXCNT</name>
              <description>Receive Count Bits.</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>RXFIFO</name>
              <description>Receive FIFO Count.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCTRL0</name>
          <description>Transmit Control Register 0.</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>TXPRELD</name>
              <description>Transmit FIFO Preaload Mode.</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TX_READY_MODE</name>
              <description>Transmit FIFO Ready Manual Mode.</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>HW control of I2CTXRDY enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>HW control of I2CTXRDY disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXFSH</name>
              <description>Transmit FIFO Flush.</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not_flushed</name>
                  <description>FIFO not flushed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>flush</name>
                  <description>Flush TX_FIFO.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXTH</name>
              <description>Transmit FIFO Threshold.</description>
              <bitRange>[11:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCTRL1</name>
          <description>Transmit Control Register 1.</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>TXRDY</name>
              <description>Transmit FIFO Preload Ready.</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TXLAST</name>
              <description>Transmit Last.</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>hold_scl_low</name>
                  <description>Hold SCL low on TX_FIFO empty.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>end_transaction</name>
                  <description>End transaction on TX_FIFO empty.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLSH_GCADDR_DIS</name>
              <description>TX FIFO Auto Flush Disable on General Call Address Match.</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>autoflush_en</name>
                  <description>The TX FIFO is automatically flushed on a General Call Address Match.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>autoflush_dis</name>
                  <description>The TX FIFO is not flushed on a General Call Address Match.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLSH_SLADDR_DIS</name>
              <description>TX FIFO Auto Flush Disable for Slave Address Match.</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>autoflush_en</name>
                  <description>The TX FIFO is automatically flushed on a Slave Address Match.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>autoflush_dis</name>
                  <description>The TX FIFO is not flushed on a Slave Address Match.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLSH_NACK_DIS</name>
              <description>TX FIFO Auto Flush Disable for NACK.</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>autoflush_en</name>
                  <description>The TX FIFO is automatically flushed if a NACK is received at the end of a slave transaction.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>autoflush_dis</name>
                  <description>The TX FIFO is not flushed when a NACK is received at the end of a slave transaction.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXFIFO</name>
              <description>Transmit FIFO Count.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO</name>
          <description>Data.</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data is read from or written to this location.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MSTR_MODE</name>
          <description>Master Control.</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>START</name>
              <description>Setting this bit to 1 will start a master transfer.</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RESTART</name>
              <description>Setting this bit to 1 will generate a repeated START.</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>STOP</name>
              <description>Setting this bit to 1 will generate a STOP condition.</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SEA</name>
              <description>Slave Extend Address Select.</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>7_bits_address</name>
                  <description>7-bit address.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10_bits_address</name>
                  <description>10-bit address.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKLO</name>
          <description>Clock Low.</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>SCL_LO</name>
              <description>SCL low period.</description>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKHI</name>
          <description>Clock high.</description>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>SCL_HI</name>
              <description>SCL high period.</description>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HS_CLK</name>
          <description>HS-Mode Clock Control.</description>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>HS_CLK_LO</name>
              <description>Slave Address.</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>HS_CLK_HI</name>
              <description>Slave Address.</description>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMEOUT</name>
          <description>Timeout.</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>TO</name>
              <description>Timeout.</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SLADDR</name>
          <description>Slave Address.</description>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>SLA</name>
              <description>Slave Address.</description>
              <bitRange>[9:0]</bitRange>
            </field>
            <field>
              <name>SLADIS</name>
              <description>Slave Address Disable.</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SLAIDX</name>
              <description>Slave Address Index.</description>
              <bitRange>[14:11]</bitRange>
            </field>
            <field>
              <name>EA</name>
              <description>Extended Address Select.</description>
              <bitRange>[15:15]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>7_bits_address</name>
                  <description>7-bit address.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10_bits_address</name>
                  <description>10-bit address.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA</name>
          <description>DMA Control.</description>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>TXEN</name>
              <description>TX channel enable.</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXEN</name>
              <description>RX channel enable.</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
