TomCrypto/max32660/svd/MAX32660.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="I2C0">
      <name>I2C1</name>
      <description>Inter-Integrated Circuit 1.</description>
      <baseAddress>0x4001E000</baseAddress>
      <interrupt>
        <name>I2C1</name>
        <value>36</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>ICC</name>
      <description>Instruction Cache Controller.</description>
      <baseAddress>0x4002A000</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CACHE_ID</name>
          <description>Cache ID.</description>
          <addressOffset>0x0000</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>RELNUM</name>
              <description>Release Number.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>PARTNUM</name>
              <description>Part Number.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CCHID</name>
              <description>Cache ID.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_SIZE</name>
          <description>Memory Configuration.</description>
          <addressOffset>0x0004</addressOffset>
          <access>read-only</access>
          <resetValue>0x00080008</resetValue>
          <fields>
            <field>
              <name>CCHSZ</name>
              <description>Cache Size.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>MEMSZ</name>
              <description>Main Memory Size.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_CTRL</name>
          <description>Cache Control and Status.</description>
          <addressOffset>0x0100</addressOffset>
          <fields>
            <field>
              <name>enabled</name>
              <description>Cache Enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Cache Bypassed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Cache Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>READY</name>
              <description>Cache Ready flag.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not_ready</name>
                  <description>Not Ready.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ready</name>
                  <description>Ready.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INVALIDATE</name>
          <description>Invalidate all registers.</description>
          <addressOffset>0x0700</addressOffset>
          <access>read-write</access>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PWRSEQ</name>
      <description>Power Sequencer.</description>
      <baseAddress>0x40006800</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x800</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIOWAKE</name>
        <value>54</value>
      </interrupt>
      <interrupt>
        <name>PF</name>
        <value>0</value>
      </interrupt>
      <registers>
        <register>
          <name>LP_CTRL</name>
          <description>Low Power Control.</description>
          <addressOffset>0x00</addressOffset>
          <fields>
            <field>
              <name>RAMRET_SEL0</name>
              <description>System RAM 0 Data retention in BACKUP mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAMRET_SEL1</name>
              <description>System RAM 1 Data retention in BACKUP mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAMRET_SEL2</name>
              <description>System RAM 2 Data retention in BACKUP mode.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAMRET_SEL3</name>
              <description>System RAM 3 Data retention in BACKUP mode.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVR</name>
              <description>Operating Voltage Range.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0_9V</name>
                  <description>0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1_0V</name>
                  <description>1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1_1V</name>
                  <description>1.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VCORE_DET_BYPASS</name>
              <description>Bypass V CORE External Supply Detection.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RETREG_EN</name>
              <description>Retention Regulator Enable.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAST_WK_EN</name>
              <description>Fast Wake-Up Mode.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BG_OFF</name>
              <description>Band Gap Disable for DEEPSLEEP and BACKUP Mode.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>on</name>
                  <description>Bandgap is always ON.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>off</name>
                  <description>Bandgap is OFF in DeepSleep mode(default).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VCORE_POR_DIS</name>
              <description>V CORE POR Disable for DEEPSLEEP and BACKUP Mode.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LDO_DIS</name>
              <description>LDO Disable.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enable if Bandgap is ON(default).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VCORE_SVM_DIS</name>
              <description>V CORE Supply Voltage Monitor Disable.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enable if Bandgap is ON(default).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDDIO_POR_DIS</name>
              <description>VDDIO Power-On Reset Monitor Disable.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_WAKEFL</name>
          <description>Low Power Mode Wakeup Flags for GPIO0.</description>
          <addressOffset>0x04</addressOffset>
          <fields>
            <field>
              <name>WAKEST</name>
              <description>Wakeup IRQ flags (write ones to clear).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LPWK_EN</name>
          <description>Low Power I/O Wakeup Enable Register 0.</description>
          <addressOffset>0x08</addressOffset>
          <fields>
            <field>
              <name>WAKEEN</name>
              <description>Enable wakeup.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LPMEMSD</name>
          <description>Low Power Memory Shutdown Control.</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>SRAM0_OFF</name>
              <description>System RAM block 0 Shut Down.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal Operating Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>shutdown</name>
                  <description>Shutdown Mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM1_OFF</name>
              <description>System RAM block 1 Shut Down.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal Operating Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>shutdown</name>
                  <description>Shutdown Mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM2_OFF</name>
              <description>System RAM block 2 Shut Down.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal Operating Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>shutdown</name>
                  <description>Shutdown Mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM3_OFF</name>
              <description>System RAM block 3 Shut Down.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal Operating Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>shutdown</name>
                  <description>Shutdown Mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
