TomCrypto/max32660/svd/MAX32660.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>RTC</name>
      <description>Real Time Clock.</description>
      <baseAddress>0x40006000</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RTC</name>
        <value>3</value>
      </interrupt>
      <registers>
        <register>
          <name>SEC</name>
          <description>RTC Second Counter.</description>
          <addressOffset>0x00</addressOffset>
          <resetMask>0x00000000</resetMask>
        </register>
        <register>
          <name>SSEC</name>
          <description>RTC Sub-second Counter.</description>
          <addressOffset>0x04</addressOffset>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>RTSS</name>
              <description>RTC Sub-second Counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RAS</name>
          <description>Time-of-day Alarm.</description>
          <addressOffset>0x08</addressOffset>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>RAS</name>
              <description>Time-of-day Alarm.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RSSA</name>
          <description>RTC sub-second alarm.</description>
          <addressOffset>0x0C</addressOffset>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>RSSA</name>
              <description>Reload value for sub-second alarm.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>RTC Control.</description>
          <addressOffset>0x10</addressOffset>
          <resetValue>0x00000008</resetValue>
          <resetMask>0xFFFFFF38</resetMask>
          <fields>
            <field>
              <name>RTCE</name>
              <description>Real Time Clock Enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADE</name>
              <description>Alarm Time-of-Day Interrupt Enable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASE</name>
              <description>Alarm Sub-second Interrupt Enable.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUSY</name>
              <description>RTC Busy.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>idle</name>
                  <description>Idle.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Busy.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDY</name>
              <description>RTC Ready.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>busy</name>
                  <description>Register has not updated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ready</name>
                  <description>Ready.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDYE</name>
              <description>RTC Ready Interrupt Enable.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALDF</name>
              <description>Time-of-Day Alarm Interrupt Flag.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>Not active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>Active.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALSF</name>
              <description>Sub-second Alarm Interrupt Flag.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>Not active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>Active.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SQE</name>
              <description>Square Wave Output Enable.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>Not active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>Active.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FT</name>
              <description>Frequency Output Selection.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>freq_1_hz</name>
                  <description>Compensated 1 Hz.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>freq_512_hz</name>
                  <description>Compensated 512 Hz.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>freq_4_khz</name>
                  <description>4 KHz.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_div_8</name>
                  <description>RTC Input Clock divided by 8.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>X32KMD</name>
              <description>32KHz Oscillator Mode.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noise_immune</name>
                  <description>Always operate in Noise Immune Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>quiet</name>
                  <description>Always operate in Quiet Mode.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>quiet_in_stop_with_warmup</name>
                  <description>Operate in Noise Immune Mode normally, switch to Quiet Mode on Stop Mode entry.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>quiet_in_stop_no_warmup</name>
                  <description>Operate in Noise Immune Mode normally, switch to Quiet Mode on Stop Mode entry.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WE</name>
              <description>Write Enable.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>Not active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>Active.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIM</name>
          <description>RTC Trim.</description>
          <addressOffset>0x14</addressOffset>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>TRIM</name>
              <description>RTC Trim.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>VBATTMR</name>
              <description>VBAT Timer Value.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCTRL</name>
          <description>RTC Oscillator Control.</description>
          <addressOffset>0x18</addressOffset>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>FILTER_EN</name>
              <description>RTC Oscillator Filter Enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IBIAS_SEL</name>
              <description>RTC Oscillator 4X Bias Current Select.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2x</name>
                  <description>Selects 2X bias current for RTC oscillator.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4x</name>
                  <description>Selects 4X bias current for RTC oscillator.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYST_EN</name>
              <description>RTC Oscillator Hysteresis Buffer Enable.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IBIAS_EN</name>
              <description>RTC Oscillator Bias Current Enable.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BYPASS</name>
              <description>RTC Crystal Bypass.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OUT32K</name>
              <description>RTC 32kHz Square Wave Output.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
