TomCrypto/max32660/svd/MAX32660.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>SPI1</name>
      <description>Serial Peripheral Interface 1.</description>
      <prependToName>SPI1</prependToName>
      <baseAddress>0x40019000</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SPI1</name>
        <value>17</value>
      </interrupt>
      <registers>
        <register>
          <name>DATA</name>
          <description>SPI 16-bit Data Access.</description>
          <addressOffset>0x00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>SPI data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>SPI Control.</description>
          <addressOffset>0x04</addressOffset>
          <fields>
            <field>
              <name>enabled</name>
              <description>SPI Enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MMEN</name>
              <description>SPI Master Mode Enable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>slave</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>master</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WOR</name>
              <description>Wired OR (open drain) Enable.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKPOL</name>
              <description>Clock Polarity.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>idle_low</name>
                  <description>SCLK idles Low (0) after character transmission/reception.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>idle_high</name>
                  <description>SCLK idles High (1) after character transmission/reception.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHASE</name>
              <description>Phase Select.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active_edge</name>
                  <description>Transmit on active edge of SCLK.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>inactive_edge</name>
                  <description>Transmit on inactive edge of SCLK.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIRQ</name>
              <description>Baud Rate Generator Timer Interrupt Request.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STR</name>
              <description>Start SPI Interrupt.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>complete</name>
                  <description>No operation/complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>start</name>
                  <description>Start operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRQE</name>
              <description>Interrupt Request Enable.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_FL</name>
          <description>SPI Interrupt Flag.</description>
          <addressOffset>0x08</addressOffset>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SLAS</name>
              <description>Slave Select.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>selected</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>not_selected</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXST</name>
              <description>Transmit Status.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>idle</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>busy</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TUND</name>
              <description>Transmit Underrun.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_event</name>
                  <description>The event has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>occurred</name>
                  <description>The event has occurred.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ROVR</name>
              <description>Receive Overrun.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_event</name>
                  <description>The event has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>occurred</name>
                  <description>The event has occurred.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABT</name>
              <description>Slave Mode Transaction Abort.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_event</name>
                  <description>The event has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>occurred</name>
                  <description>The event has occurred.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COL</name>
              <description>Collision.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_event</name>
                  <description>The event has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>occurred</name>
                  <description>The event has occurred.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOVR</name>
              <description>Transmit Overrun.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_event</name>
                  <description>The event has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>occurred</name>
                  <description>The event has occurred.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRQ</name>
              <description>SPI Interrupt Request.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>inactive</name>
                  <description>No interrupt is pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pending</name>
                  <description>An interrupt is pending.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE</name>
          <description>SPI Mode.</description>
          <addressOffset>0x0C</addressOffset>
          <fields>
            <field>
              <name>SSV</name>
              <description>Slave Select Value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lo</name>
                  <description>The SSEL pin will be driven low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>hi</name>
                  <description>The SSEL pin will be driven high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SS_IO</name>
              <description>Slave Select I/O.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>input</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>output</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NUMBITS</name>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bits16</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bits1</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bits2</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bits3</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bits4</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bits5</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bits6</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bits7</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bits8</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bits9</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bits10</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bits11</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bits12</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bits13</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bits14</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bits15</name>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_LJ</name>
              <description>Transmit Left Justify.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BRG</name>
          <description>Baud Rate Reload Value.</description>
          <addressOffset>0x14</addressOffset>
          <resetValue>0x0000FFFF</resetValue>
          <fields>
            <field>
              <name>DIV</name>
              <description>Baud Rate Reload Value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA</name>
          <description>SPI DMA.</description>
          <addressOffset>0x18</addressOffset>
          <resetValue>0x00070007</resetValue>
          <fields>
            <field>
              <name>TX_FIFO_LVL</name>
              <description>Transmit FIFO Level.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>entry1</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>entries2</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>entries3</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>entries4</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>entries5</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>entries6</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>entries7</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>entries8</name>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_FIFO_CLR</name>
              <description>Transmit FIFO Clear.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>complete</name>
                  <description>No operation/complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>start</name>
                  <description>Start operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_FIFO_CNT</name>
              <description>Transmit FIFO Count.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_DMA_EN</name>
              <description>Transmit DMA Enable.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_FIFO_LVL</name>
              <description>Receive FIFO Level.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>entry1</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>entries2</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>entries3</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>entries4</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>entries5</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>entries6</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>entries7</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>entries8</name>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_FIFO_CLR</name>
              <description>Receive FIFO Clear.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>complete</name>
                  <description>No operation/complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>start</name>
                  <description>Start operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_FIFO_CNT</name>
              <description>Receive FIFO Count.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_DMA_EN</name>
              <description>Receive DMA Enable.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
