TomCrypto/max32660/svd/MAX32660.xml
        <register>
          <name>I2S_CTRL</name>
          <description>I2S Control.</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>I2S_EN</name>
              <description>I2S Mode Enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2S_MUTE</name>
              <description>I2S Mute transmit.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal Transmit.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>replaced</name>
                  <description>Transmit data is replaced with 0.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2S_PAUSE</name>
              <description>I2S Pause transmit/receive.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal Transmit.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>halt</name>
                  <description>Halt transmit and receive FIFO and DMA access, transmit 0's.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2S_MONO</name>
              <description>I2S Monophonic Audio Mode.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>stereophonic</name>
                  <description>Stereophonic audio.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>monophonic</name>
                  <description>Monophonic audio format.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2S_LJ</name>
              <description>I2S Left Justify.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>normal</name>
                  <description>Normal I2S audio protocol.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>replaced</name>
                  <description>Audio data is synchronized with SSEL.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>TMR0</name>
      <description>Low-Power Configurable Timer 0.</description>
      <baseAddress>0x40010000</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TMR0</name>
        <value>5</value>
      </interrupt>
      <registers>
        <register>
          <name>CNT</name>
          <description>Timer Counter.</description>
          <addressOffset>0x00</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>COUNT</name>
              <description>The current count value for the timer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMP</name>
          <description>Timer Compare.</description>
          <addressOffset>0x04</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>COMPARE</name>
              <description>Compare value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM</name>
          <description>Timer PWM.</description>
          <addressOffset>0x08</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PWM</name>
              <description>Timer PWM Match.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR</name>
          <description>Timer Interrupt Status.</description>
          <addressOffset>0x0C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>IRQ</name>
              <description>Interrupt Flag for Timer A.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CN</name>
          <description>Timer Control.</description>
          <addressOffset>0x10</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TMODE</name>
              <description>Mode Select.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>one_shot</name>
                  <description>One-Shot Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>continuous</name>
                  <description>Continuous Mode.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>counter</name>
                  <description>Counter Mode.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pwm</name>
                  <description>PWM Mode.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>capture</name>
                  <description>Capture Mode.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>compare</name>
                  <description>Compare Mode.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gated</name>
                  <description>Gated Mode.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>capture_compare</name>
                  <description>Capture/Compare Mode.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRES</name>
              <description>Timer Prescaler Select.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>div_by_1</name>
                  <description>Divide by 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_by_2</name>
                  <description>Divide by 2.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_by_4</name>
                  <description>Divide by 4.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_by_8</name>
                  <description>Divide by 8.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_by_16</name>
                  <description>Divide by 16.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_by_32</name>
                  <description>Divide by 32.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_by_64</name>
                  <description>Divide by 64.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>div_by_128</name>
                  <description>Divide by 128.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TPOL</name>
              <description>Timer Polarity.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEN</name>
              <description>Timer Enable.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRES3</name>
              <description>Timer Prescale Select MSB.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PWMSYNC</name>
              <description>PWM Synchronization Mode.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NOLHPOL</name>
              <description>PWM Phase A (Non-Overlapping High) Polarity.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NOLLPOL</name>
              <description>PWM Phase A-prime (Non-Overlapping Low) Polarity.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PWMCKBD</name>
              <description>PWM Phase A-Prime Output Disable.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
